Repository: datagandra/Cheffy
Catalog: Cheffy/Resources/*.lproj/Localizable.strings
Languages: ar, es, hi, te, zh

# app_subtitle
source: AI Recipe Generator
ar: مولد الوصفات بالذكاء الاصطناعي
es: Generador de Recetas IA
hi: AI रेसिपी जनरेटर
te: AI వంటకాల జనరేటర్
zh: AI食谱生成器

source: Close
ar: إغلاق
es: Cerrar
hi: बंद करें
te: మూసివేయి
zh: 关闭

source: Back
ar: رجوع
es: Atrás
hi: वापस
te: వెనుకకు
zh: 返回

source: Next
ar: التالي
es: Siguiente
hi: अगला
te: తదుపరి
zh: 下一步

source: Previous
ar: السابق
es: Anterior
hi: पिछला
te: మునుపటి
zh: 上一步

source: Finish
ar: إنهاء
es: Terminar
hi: समाप्त
te: పూర్తి
zh: 完成

source: Cancel
ar: إلغاء
es: Cancelar
hi: रद्द करें
te: రద్దు
zh: 取消

source: Done
ar: تم
es: Hecho
hi: हो गया
te: పూర్తయింది
zh: 完成

# recipe_generator_title
source: AI Recipe Generator
ar: مولد الوصفات بالذكاء الاصطناعي
es: Generador de Recetas IA
hi: AI रेसिपी जनरेटर
te: AI వంటకాల జనరేటర్
zh: AI食谱生成器

# recipe_description_label
source: Recipe Description
ar: وصف الوصفة
es: Descripción de la Receta
hi: रेसिपी विवरण
te: వంటక వివరణ
zh: 食谱描述

# recipe_description_placeholder
source: Enter recipe name or description (Leave empty for popular %@ recipes)
ar: أدخل اسم أو وصف الوصفة (اتركه فارغاً للوصفات الشائعة من %@)
es: Ingresa el nombre o descripción de la receta (Deja vacío para recetas populares de %@)
hi: रेसिपी का नाम या विवरण दर्ज करें (लोकप्रिय %@ रेसिपी के लिए खाली छोड़ें)
te: వంటక పేరు లేదా వివరణను నమోదు చేయండి (జనప్రియ %@ వంటకాల కోసం ఖాళీగా వదిలివేయండి)
zh: 输入食谱名称或描述（留空生成热门%@食谱）

source: Generate Recipe
ar: إنشاء وصفة
es: Generar Receta
hi: रेसिपी जनरेट करें
te: వంటకాన్ని జనరేట్ చేయండి
zh: 生成食谱

source: Generate Popular %@ Recipes
ar: إنشاء وصفات شائعة من %@
es: Generar Recetas Populares de %@
hi: लोकप्रिय %@ रेसिपी जनरेट करें
te: జనప్రియ %@ వంటకాలను జనరేట్ చేయండి
zh: 生成热门%@食谱

source: Generating...
ar: جاري الإنشاء...
es: Generando...
hi: जनरेट हो रहा है...
te: జనరేట్ చేస్తోంది...
zh: 生成中...

# generate_button_hint
source: Double tap to generate recipe
ar: انقر مرتين لإنشاء وصفة
es: Doble toque para generar receta
hi: रेसिपी जनरेट करने के लिए दो बार टैप करें
te: వంటకాన్ని జనరేట్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击生成食谱

# generate_button_disabled_hint
source: Please fill in required fields
ar: يرجى ملء الحقول المطلوبة
es: Por favor completa los campos requeridos
hi: कृपया आवश्यक फ़ील्ड भरें
te: దయచేసి అవసరమైన ఫీల్డ్లను నింపండి
zh: 请填写必填字段

# cuisine_label
source: Cuisine
ar: المطبخ
es: Cocina
hi: खाना
te: వంటక శైలి
zh: 菜系

# cuisine_hint
source: Tap to select cuisine type
ar: انقر لاختيار نوع المطبخ
es: Toca para seleccionar tipo de cocina
hi: खाने का प्रकार चुनने के लिए टैप करें
te: వంటక శైలిని ఎంచుకోవడానికి నొక్కండి
zh: 点击选择菜系类型

source: Italian
ar: إيطالي
es: Italiana
hi: इतालवी
te: ఇటాలియన్
zh: 意大利

source: French
ar: فرنسي
es: Francesa
hi: फ्रेंच
te: ఫ్రెంచ్
zh: 法国

source: Chinese
ar: صيني
es: China
hi: चीनी
te: చైనీస్
zh: 中国

source: Japanese
ar: ياباني
es: Japonesa
hi: जापानी
te: జపనీస్
zh: 日本

source: Indian
ar: هندي
es: India
hi: भारतीय
te: భారతీయ
zh: 印度

source: Mexican
ar: مكسيكي
es: Mexicana
hi: मैक्सिकन
te: మెక్సికన్
zh: 墨西哥

source: Thai
ar: تايلندي
es: Tailandesa
hi: थाई
te: థాయ్
zh: 泰国

source: Mediterranean
ar: متوسطي
es: Mediterránea
hi: मेडिटरेनियन
te: మెడిటరేనియన్
zh: 地中海

source: American
ar: أمريكي
es: Americana
hi: अमेरिकन
te: అమెరికన్
zh: 美国

source: Greek
ar: يوناني
es: Griega
hi: ग्रीक
te: గ్రీక్
zh: 希腊

# difficulty_label
source: Difficulty
ar: الصعوبة
es: Dificultad
hi: कठिनाई
te: కష్టత
zh: 难度

source: Easy
ar: سهل
es: Fácil
hi: आसान
te: సులభం
zh: 简单

source: Medium
ar: متوسط
es: Media
hi: मध्यम
te: మధ్యస్థం
zh: 中等

source: Hard
ar: صعب
es: Difícil
hi: कठिन
te: కష్టం
zh: 困难

# dietary_restrictions_label
source: Dietary Restrictions
ar: القيود الغذائية
es: Restricciones Dietéticas
hi: आहार प्रतिबंध
te: ఆహార పరిమితులు
zh: 饮食限制

source: Vegetarian
ar: نباتي
es: Vegetariana
hi: शाकाहारी
te: శాకాహారి
zh: 素食

source: Vegan
ar: نباتي صرف
es: Vegana
hi: वीगन
te: వీగన్
zh: 纯素

source: Gluten-Free
ar: خالي من الغلوتين
es: Sin Gluten
hi: ग्लूटेन फ्री
te: గ్లూటెన్ ఫ్రీ
zh: 无麸质

source: Dairy-Free
ar: خالي من الألبان
es: Sin Lácteos
hi: डेयरी फ्री
te: పాల ఉత్పత్తులు లేని
zh: 无乳制品

source: Nut-Free
ar: خالي من المكسرات
es: Sin Frutos Secos
hi: नट फ्री
te: గింజలు లేని
zh: 无坚果

source: Low-Carb
ar: منخفض الكربوهيدرات
es: Baja en Carbohidratos
hi: लो कार्ब
te: తక్కువ కార్బోహైడ్రేట్
zh: 低碳水

source: Keto
ar: كيتو
hi: कीटो
te: కీటో
zh: 生酮

source: Paleo
ar: باليو
hi: पैलियो
te: పాలియో
zh: 古饮食

source: Recipe Name
ar: اسم الوصفة
es: Nombre de la Receta
hi: रेसिपी का नाम
te: వంటక పేరు
zh: 食谱名称

source: Prep Time
ar: وقت التحضير
es: Tiempo de Preparación
hi: तैयारी का समय
te: సిద్ధపరచే సమయం
zh: 准备时间

source: Cook Time
ar: وقت الطهي
es: Tiempo de Cocción
hi: पकाने का समय
te: వండే సమయం
zh: 烹饪时间

source: Total Time
ar: الوقت الإجمالي
es: Tiempo Total
hi: कुल समय
te: మొత్తం సమయం
zh: 总时间

source: Servings
ar: الحصص
es: Porciones
hi: सर्विंग्स
te: వంతులు
zh: 份数

source: Calories
ar: السعرات الحرارية
es: Calorías
hi: कैलोरी
te: కేలరీలు
zh: 卡路里

source: Ingredients
ar: المكونات
es: Ingredientes
hi: सामग्री
te: పదార్థాలు
zh: 食材

source: Instructions
ar: التعليمات
es: Instrucciones
hi: निर्देश
te: సూచనలు
zh: 说明

source: Steps
ar: الخطوات
es: Pasos
hi: चरण
te: దశలు
zh: 步骤

source: Step
ar: خطوة
es: Paso
hi: चरण
te: దశ
zh: 步骤

# step_of
source: %d of %d
ar: %d من %d
es: %d de %d
hi: %d/%d
te: %d/%d
zh: %d/%d

source: minutes
ar: دقائق
es: minutos
hi: मिनट
te: నిమిషాలు
zh: 分钟

source: min
ar: د
hi: मिन
te: నిమి
zh: 分

# servings_count
source: %d servings
ar: %d حصص
es: %d porciones
hi: %d सर्विंग्स
te: %d వంతులు
zh: %d份

# ingredients_count
source: Ingredients (%d)
ar: المكونات (%d)
es: Ingredientes (%d)
hi: सामग्री (%d)
te: పదార్థాలు (%d)
zh: 食材（%d）

source: Show Less
ar: عرض أقل
es: Mostrar Menos
hi: कम दिखाएं
te: తక్కువ చూపించు
zh: 显示更少

# show_more
source: + %d more ingredients
ar: + %d مكونات أخرى
es: + %d ingredientes más
hi: + %d और सामग्री
te: + %d మరిన్ని పదార్థాలు
zh: + %d个更多食材

source: Cooking Mode
ar: وضع الطهي
es: Modo de Cocción
hi: खाना बनाने का मोड
te: వంటక మోడ్
zh: 烹饪模式

source: Current Step
ar: الخطوة الحالية
es: Paso Actual
hi: वर्तमान चरण
te: ప్రస్తుత దశ
zh: 当前步骤

source: Start Cooking
ar: بدء الطهي
es: Comenzar a Cocinar
hi: खाना बनाना शुरू करें
te: వంటకం ప్రారంభించండి
zh: 开始烹饪

source: Pause
ar: إيقاف مؤقت
es: Pausar
hi: रोकें
te: ఆపు
zh: 暂停

source: Resume
ar: استئناف
es: Reanudar
hi: जारी रखें
te: కొనసాగించు
zh: 继续

# repeat_step
source: Repeat
ar: تكرار
es: Repetir
hi: दोहराएं
te: పునరావృతం
zh: 重复

# repeat_step_hint
source: Repeat current step
ar: تكرار الخطوة الحالية
es: Repetir paso actual
hi: वर्तमान चरण दोहराएं
te: ప్రస్తుత దశను పునరావృతం చేయండి
zh: 重复当前步骤

source: Cooking complete!
ar: اكتمل الطهي!
es: ¡Cocción completa!
hi: खाना बनाना पूरा!
te: వంటకం పూర్తయింది!
zh: 烹饪完成！

# chef_tip
source: Chef's Tip
ar: نصيحة الشيف
es: Consejo del Chef
hi: शेफ की सलाह
te: శెఫ్ చిట్కా
zh: 厨师小贴士

# chef_pro_tips
source: Chef's Pro Tips
ar: نصائح الشيف المحترف
es: Consejos Pro del Chef
hi: प्रोफेशनल शेफ की सलाह
te: ప్రొఫెషనల్ శెఫ్ చిట్కాలు
zh: 专业厨师贴士

source: Cooking Techniques
ar: تقنيات الطهي
es: Técnicas de Cocción
hi: खाना बनाने की तकनीक
te: వంటక పద్ధతులు
zh: 烹饪技巧

source: Temperature
ar: درجة الحرارة
es: Temperatura
hi: तापमान
te: ఉష్ణోగ్రత
zh: 温度

# temperature_celsius
source: %d°C
ar: %d°م

source: Step Timer
ar: مؤقت الخطوة
es: Temporizador del Paso
hi: चरण टाइमर
te: దశ టైమర్
zh: 步骤计时器

# timer_start
source: Start
ar: بدء
es: Iniciar
hi: शुरू करें
te: ప్రారంభించు
zh: 开始

# timer_pause
source: Pause
ar: إيقاف مؤقت
es: Pausar
hi: रोकें
te: ఆపు
zh: 暂停

# timer_reset
source: Reset
ar: إعادة تعيين
es: Reiniciar
hi: रीसेट
te: రీసెట్
zh: 重置

source: Detailed Instructions
ar: تعليمات مفصلة
es: Instrucciones Detalladas
hi: विस्तृत निर्देश
te: వివరణాత్మక సూచనలు
zh: 详细说明

# detailed_instructions_loading
source: Loading...
ar: جاري التحميل...
es: Cargando...
hi: लोड हो रहा है...
te: లోడ్ అవుతోంది...
zh: 加载中...

# detailed_instructions_refresh
source: Refresh
ar: تحديث
es: Actualizar
hi: रिफ्रेश
te: రిఫ్రెష్
zh: 刷新

# detailed_instructions_generating
source: Generating detailed instructions...
ar: جاري إنشاء تعليمات مفصلة...
es: Generando instrucciones detalladas...
hi: विस्तृत निर्देश जनरेट हो रहे हैं...
te: వివరణాత్మక సూచనలను జనరేట్ చేస్తోంది...
zh: 生成详细说明中...

# detailed_instructions_title
source: AI-Generated Detailed Cooking Instructions
ar: تعليمات مفصلة مولدة بالذكاء الاصطناعي
es: Instrucciones Detalladas Generadas por IA
hi: AI जनरेटेड विस्तृत खाना बनाने के निर्देश
te: AI జనరేట్ చేసిన వివరణాత్మక వంటక సూచనలు
zh: AI生成的详细烹饪说明

# detailed_instructions_subtitle
source: Get AI-Generated Detailed Instructions
ar: الحصول على تعليمات مفصلة مولدة بالذكاء الاصطناعي
es: Obtener Instrucciones Detalladas Generadas por IA
hi: AI जनरेटेड विस्तृत निर्देश प्राप्त करें
te: AI జనరేట్ చేసిన వివరణాత్మక సూచనలను పొందండి
zh: 获取AI生成的详细说明

# detailed_instructions_description
source: Tap the refresh button to generate comprehensive cooking instructions with professional tips, timing guidance, and step-by-step details.
ar: انقر على زر التحديث لإنشاء تعليمات طهي شاملة مع نصائح احترافية وتوجيهات زمنية وتفاصيل خطوة بخطوة.
es: Toca el botón de actualizar para generar instrucciones de cocción completas con consejos profesionales, orientación de tiempo y detalles paso a paso.
hi: पेशेवर सुझाव, समय मार्गदर्शन और चरण-दर-चरण विवरण के साथ व्यापक खाना बनाने के निर्देश जनरेट करने के लिए रिफ्रेश बटन टैप करें।
te: ప్రొఫెషనల్ చిట్కాలు, సమయ మార్గదర్శకత్వం మరియు దశలవారీ వివరాలతో కూడిన సమగ్ర వంటక సూచనలను జనరేట్ చేయడానికి రిఫ్రెష్ బటన్ నొక్కండి.
zh: 点击刷新按钮生成包含专业技巧、时间指导和逐步细节的综合烹饪说明。

# detailed_instructions_unavailable
source: No detailed instructions available. Please generate them first.
ar: لا توجد تعليمات مفصلة متاحة. يرجى إنشاؤها أولاً.
es: No hay instrucciones detalladas disponibles. Por favor genera primero.
hi: विस्तृत निर्देश उपलब्ध नहीं हैं। कृपया पहले जनरेट करें।
te: వివరణాత్మక సూచనలు అందుబాటులో లేవు. దయచేసి మొదట జనరేట్ చేయండి.
zh: 暂无详细说明。请先生成。

source: Complete Recipe Steps
ar: خطوات الوصفة الكاملة
es: Pasos Completos de la Receta
hi: पूरी रेसिपी के चरण
te: పూర్తి వంటక దశలు
zh: 完整食谱步骤

source: Recipe Overview
ar: نظرة عامة على الوصفة
es: Resumen de la Receta
hi: रेसिपी अवलोकन
te: వంటక అవలోకనం
zh: 食谱概览

source: Wine Pairings
ar: توصيلات النبيذ
es: Maridajes de Vino
hi: वाइन पेयरिंग
te: వైన్ జతలు
zh: 葡萄酒搭配

# chef_notes
source: Chef's Notes
ar: ملاحظات الشيف
es: Notas del Chef
hi: शेफ के नोट्स
te: శెఫ్ గమనికలు
zh: 厨师笔记

source: Favorites
ar: المفضلة
es: Favoritos
hi: पसंदीदा
te: ఇష్టమైనవి
zh: 收藏

source: Add to favorites
ar: إضافة إلى المفضلة
es: Agregar a favoritos
hi: पसंदीदा में जोड़ें
te: ఇష్టమైనవాటికి జోడించండి
zh: 添加到收藏

source: Remove from favorites
ar: إزالة من المفضلة
es: Quitar de favoritos
hi: पसंदीदा से हटाएं
te: ఇష్టమైనవాటి నుండి తీసివేయండి
zh: 从收藏中移除

# no_favorites
source: No favorites yet. Your favorite recipes will appear here.
ar: لا توجد مفضلات بعد. ستظهر وصفاتك المفضلة هنا.
es: Aún no hay favoritos. Tus recetas favoritas aparecerán aquí.
hi: अभी तक कोई पसंदीदा नहीं। आपकी पसंदीदा रेसिपी यहाँ दिखाई देंगी।
te: ఇంకా ఇష్టమైనవి లేవు. మీ ఇష్టమైన వంటకాలు ఇక్కడ కనిపిస్తాయి.
zh: 暂无收藏。您收藏的食谱将显示在这里。

# no_search_results
source: No search results found. Try adjusting your search terms.
ar: لم يتم العثور على نتائج بحث. حاول تعديل مصطلحات البحث.
es: No se encontraron resultados de búsqueda. Intenta ajustar tus términos de búsqueda.
hi: कोई खोज परिणाम नहीं मिला। कृपया अपने खोज शब्दों को समायोजित करने का प्रयास करें।
te: శోధన ఫలితాలు కనుగొనబడలేదు. మీ శోధన పదాలను సర్దుబాటు చేయడానికి ప్రయత్నించండి.
zh: 未找到搜索结果。请尝试调整搜索词。

# view_recipe_details
source: View recipe details for %@
ar: عرض تفاصيل الوصفة %@
es: Ver detalles de la receta %@
hi: %@ की रेसिपी विवरण देखें
te: %@ వంటక వివరాలను చూడండి
zh: 查看%@的食谱详情

# start_cooking_recipe
source: Start cooking %@
ar: بدء طهي %@
es: Comenzar a cocinar %@
hi: %@ खाना बनाना शुरू करें
te: %@ వంటకాన్ని ప్రారంభించండి
zh: 开始烹饪%@

# remove_recipe_from_favorites
source: Remove %@ from favorites
ar: إزالة %@ من المفضلة
es: Quitar %@ de favoritos
hi: %@ को पसंदीदा से हटाएं
te: %@ ని ఇష్టమైనవాటి నుండి తీసివేయండి
zh: 从收藏中移除%@

source: Settings
ar: الإعدادات
es: Configuración
hi: सेटिंग्स
te: సెట్టింగ్లు
zh: 设置

source: API Key
ar: مفتاح API
es: Clave API
hi: API की
te: API కీ
zh: API密钥

# api_key_set
source: Set
ar: مضبوط
es: Configurada
hi: सेट
te: సెట్ చేయబడింది
zh: 已设置

# api_key_not_set
source: Not Set
ar: غير مضبوط
es: No Configurada
hi: सेट नहीं
te: సెట్ చేయబడలేదు
zh: 未设置

# api_key_hint
source: Double tap to configure API key
ar: انقر مرتين لضبط مفتاح API
es: Doble toque para configurar clave API
hi: API की कॉन्फ़िगर करने के लिए दो बार टैप करें
te: API కీని కాన్ఫిగర్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击配置API密钥

source: Subscription
ar: الاشتراك
es: Suscripción
hi: सदस्यता
te: చందా
zh: 订阅

# subscription_free
source: Free
ar: مجاني
es: Gratis
hi: मुफ्त
te: ఉచితం
zh: 免费

source: Generations Used
ar: الإنشاءات المستخدمة
es: Generaciones Usadas
hi: उपयोग किए गए जनरेशन
te: ఉపయోగించిన జనరేషన్లు
zh: 已使用生成次数

# reset_generations
source: Double tap to reset generation count
ar: انقر مرتين لإعادة تعيين عدد الإنشاءات
es: Doble toque para reiniciar conteo de generaciones
hi: जनरेशन काउंटर रीसेट करने के लिए दो बार टैप करें
te: జనరేషన్ కౌంటర్ రీసెట్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击重置生成计数

# upgrade_to_pro
source: Double tap to upgrade to PRO subscription
ar: انقر مرتين للترقية إلى اشتراك PRO
es: Doble toque para actualizar a suscripción PRO
hi: प्रो सदस्यता में अपग्रेड करने के लिए दो बार टैप करें
te: ప్రొ చందాకు అప్‌గ్రేడ్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击升级到专业版订阅

source: App Version
ar: إصدار التطبيق
es: Versión de la App
hi: ऐप संस्करण
te: యాప్ వెర్షన్
zh: 应用版本

# manage_cached_recipes
source: Double tap to manage cached recipes
ar: انقر مرتين لإدارة الوصفات المخزنة مؤقتاً
es: Doble toque para administrar recetas en caché
hi: कैश की गई रेसिपी प्रबंधित करने के लिए दो बार टैप करें
te: కాష్ చేయబడిన వంటకాలను నిర్వహించడానికి రెండుసార్లు నొక్కండి
zh: 双击管理缓存的食谱

# welcome_title
source: Welcome to Cheffy
ar: مرحباً بك في Cheffy
es: Bienvenido a Cheffy
hi: Cheffy में आपका स्वागत है
te: Cheffy కి స్వాగతం
zh: 欢迎使用Cheffy

# welcome_subtitle
source: Your AI-powered recipe companion
ar: رفيق الوصفات بالذكاء الاصطناعي
es: Tu compañero de recetas con IA
hi: आपका AI रेसिपी साथी
te: మీ AI వంటక సహచరుడు
zh: 您的AI食谱助手

# onboarding_step_1_title
source: Discover Recipes
ar: اكتشف الوصفات
es: Descubre Recetas
hi: रेसिपी खोजें
te: వంటకాలను کشف کریں
zh: 发现食谱

# onboarding_step_1_description
source: Generate personalized recipes based on your preferences and available ingredients
ar: أنشئ وصفات مخصصة بناءً على تفضيلاتك والمكونات المتاحة
es: Genera recetas personalizadas basadas en tus preferencias e ingredientes disponibles
hi: आपकी प्राथमिकताओं और उपलब्ध सामग्री के आधार पर व्यक्तिगत रेसिपी जनरेट करें
te: మీ ప్రాధాన్యతలు మరియు అందుబాటులో ఉన్న పదార్థాల ఆధారంగా వ్యక్తిగతీకరించిన వంటకాలను జనరేట్ చేయండి
zh: 根据您的偏好和可用食材生成个性化食谱

# onboarding_step_2_title
source: Smart Cooking
ar: الطهي الذكي
es: Cocina Inteligente
hi: स्मार्ट कुकिंग
te: స్మార్ట్ వంటకం
zh: 智能烹饪

# onboarding_step_2_description
source: Get step-by-step cooking instructions with AI-powered tips and techniques
ar: احصل على تعليمات خطوة بخطوة مع نصائح وتقنيات مدعومة بالذكاء الاصطناعي
es: Obtén instrucciones paso a paso con consejos y técnicas impulsadas por IA
hi: AI-संचालित सुझावों और तकनीकों के साथ चरण-दर-चरण खाना बनाने के निर्देश प्राप्त करें
te: AI-ఆధారిత చిట్కాలు మరియు పద్ధతులతో దశలవారీ వంటక సూచనలను పొందండి
zh: 获得AI驱动的技巧和技术的逐步烹饪说明

# onboarding_step_3_title
source: Save & Share
ar: احفظ وشارك
es: Guarda y Comparte
hi: सहेजें और साझा करें
te: సేవ్ మరియు షేర్
zh: 保存和分享

# onboarding_step_3_description
source: Save your favorite recipes and share them with friends and family
ar: احفظ وصفاتك المفضلة وشاركها مع الأصدقاء والعائلة
es: Guarda tus recetas favoritas y compártelas con amigos y familia
hi: अपनी पसंदीदा रेसिपी सहेजें और दोस्तों और परिवार के साथ साझा करें
te: మీ ఇష్టమైన వంటకాలను సేవ్ చేసి స్నేహితులు మరియు కుటుంబంతో షేర్ చేయండి
zh: 保存您喜爱的食谱并与朋友和家人分享

source: Get Started
ar: ابدأ
es: Comenzar
hi: शुरू करें
te: ప్రారంభించండి
zh: 开始使用

source: Error generating recipe
ar: خطأ في إنشاء الوصفة
es: Error al generar receta
hi: रेसिपी जनरेट करने में त्रुटि
te: వంటకాన్ని జనరేట్ చేయడంలో లోపం
zh: 生成食谱时出错

# error_network
source: Network error occurred
ar: حدث خطأ في الشبكة
es: Error de red ocurrió
hi: नेटवर्क त्रुटि हुई
te: నెట్‌వర్క్ లోపం సంభవించింది
zh: 网络错误

# error_api_key
source: Please configure your API key in Settings
ar: يرجى ضبط مفتاح API في الإعدادات
es: Por favor configura tu clave API en Configuración
hi: कृपया सेटिंग्स में अपनी API की कॉन्फ़िगर करें
te: దయచేసి సెట్టింగ్లలో మీ API కీని కాన్ఫిగర్ చేయండి
zh: 请在设置中配置您的API密钥

# error_no_ingredients
source: No ingredients available
ar: لا توجد مكونات متاحة
es: No hay ingredientes disponibles
hi: कोई सामग्री उपलब्ध नहीं
te: పదార్థాలు అందుబాటులో లేవు
zh: 没有可用食材

# error_no_steps
source: No cooking steps available
ar: لا توجد خطوات طهي متاحة
es: No hay pasos de cocción disponibles
hi: कोई खाना बनाने के चरण उपलब्ध नहीं
te: వంటక దశలు అందుబాటులో లేవు
zh: 没有可用的烹饪步骤

# hint_empty_prompt
source: Leave empty for popular %@ recipes
ar: اتركه فارغاً للوصفات الشائعة من %@
es: Deja vacío para recetas populares de %@
hi: लोकप्रिय %@ रेसिपी के लिए खाली छोड़ें
te: జనప్రియ %@ వంటకాల కోసం ఖాళీగా వదిలివేయండి
zh: 留空生成热门%@食谱

# hint_provide_details
source: Please provide more details
ar: يرجى تقديم المزيد من التفاصيل
es: Por favor proporciona más detalles
hi: कृपया अधिक विवरण प्रदान करें
te: దయచేసి మరిన్ని వివరాలను అందించండి
zh: 请提供更多详情

# warning_short_description
source: Warning: Please provide more details
ar: تحذير: يرجى تقديم المزيد من التفاصيل
es: Advertencia: Por favor proporciona más detalles
hi: चेतावनी: कृपया अधिक विवरण प्रदान करें
te: హెచ్చరిక: దయచేసి మరిన్ని వివరాలను అందించండి
zh: 警告：请提供更多详情

# tip_timing_precise
source: • Follow the timing precisely for best results
ar: • اتبع التوقيت بدقة للحصول على أفضل النتائج
es: • Sigue el tiempo precisamente para mejores resultados
hi: • सर्वोत्तम परिणामों के लिए समय का सटीक पालन करें
te: • ఉత్తమ ఫలితాల కోసం సమయాన్ని ఖచ్చితంగా అనుసరించండి
zh: • 严格按照时间以获得最佳效果

# tip_temperature_settings
source: • Use the recommended temperature settings
ar: • استخدم إعدادات درجة الحرارة الموصى بها
es: • Usa la configuración de temperatura recomendada
hi: • अनुशंसित तापमान सेटिंग्स का उपयोग करें
te: • సిఫార్సు చేయబడిన ఉష్ణోగ్రత సెట్టింగ్లను ఉపయోగించండి
zh: • 使用推荐的温度设置

# tip_visual_cues
source: • Pay attention to visual cues and doneness indicators
ar: • انتبه للإشارات البصرية ومؤشرات النضج
es: • Presta atención a las señales visuales e indicadores de cocción
hi: • दृश्य संकेतों और पकने के संकेतकों पर ध्यान दें
te: • దృశ్య సంకేతాలు మరియు పరిపక్వత సూచికలకు శ్రద్ధ వహించండి
zh: • 注意视觉提示和熟度指标

# tip_workspace_clean
source: • Keep your workspace clean and organized
ar: • حافظ على مساحة عملك نظيفة ومنظمة
es: • Mantén tu espacio de trabajo limpio y organizado
hi: • अपना कार्यस्थान साफ और व्यवस्थित रखें
te: • మీ పని ప్రదేశాన్ని శుభ్రంగా మరియు క్రమబద్ధంగా ఉంచండి
zh: • 保持工作区域清洁有序

# accessibility_recipe_card
source: %@, %@ cuisine, %@ difficulty, %@ total time
ar: %@، مطبخ %@، صعوبة %@، وقت إجمالي %@
es: %@, cocina %@, dificultad %@, tiempo total %@
hi: %@, %@ खाना, %@ कठिनाई, %@ कुल समय
te: %@, %@ వంటక శైలి, %@ కష్టత, %@ మొత్తం సమయం
zh: %@，%@菜系，%@难度，%@总时间

# accessibility_recipe_card_hint
source: Double tap to view recipe details
ar: انقر مرتين لعرض تفاصيل الوصفة
es: Doble toque para ver detalles de la receta
hi: रेसिपी विवरण देखने के लिए दो बार टैप करें
te: వంటక వివరాలను చూడడానికి రెండుసార్లు నొక్కండి
zh: 双击查看食谱详情

# accessibility_cooking_step
source: Step %d: %@
ar: خطوة %d: %@
es: Paso %d: %@
hi: चरण %d: %@
te: దశ %d: %@
zh: 步骤%d：%@

# accessibility_current_step
source: Current step
ar: الخطوة الحالية
es: Paso actual
hi: वर्तमान चरण
te: ప్రస్తుత దశ
zh: 当前步骤

# accessibility_select_step
source: Tap to select this step
ar: انقر لاختيار هذه الخطوة
es: Toca para seleccionar este paso
hi: इस चरण को चुनने के लिए टैप करें
te: ఈ దశను ఎంచుకోవడానికి నొక్కండి
zh: 点击选择此步骤

# accessibility_generate_button
source: Generate Recipe
ar: إنشاء وصفة
es: Generar Receta
hi: रेसिपी जनरेट करें
te: వంటకాన్ని జనరేట్ చేయండి
zh: 生成食谱

# accessibility_generate_enabled
source: Double tap to generate recipe
ar: انقر مرتين لإنشاء وصفة
es: Doble toque para generar receta
hi: रेसिपी जनरेट करने के लिए दो बार टैप करें
te: వంటకాన్ని జనరేట్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击生成食谱

# accessibility_generate_disabled
source: Please fill in required fields
ar: يرجى ملء الحقول المطلوبة
es: Por favor completa los campos requeridos
hi: कृपया आवश्यक फ़ील्ड भरें
te: దయచేసి అవసరమైన ఫీల్డ్లను నింపండి
zh: 请填写必填字段

# accessibility_character_count
source: Character count: %d out of 200
ar: عدد الأحرف: %d من 200
es: Conteo de caracteres: %d de 200
hi: अक्षर गणना: %d/200
te: అక్షరాల సంఖ్య: %d/200
zh: 字符计数：%d/200

# accessibility_hint_empty
source: Hint: Leave empty for popular %@ recipes
ar: نصيحة: اتركه فارغاً للوصفات الشائعة من %@
es: Consejo: Deja vacío para recetas populares de %@
hi: सुझाव: लोकप्रिय %@ रेसिपी के लिए खाली छोड़ें
te: చిట్కా: జనప్రియ %@ వంటకాల కోసం ఖాళీగా వదిలివేయండి
zh: 提示：留空生成热门%@食谱

# accessibility_warning_details
source: Warning: Please provide more details
ar: تحذير: يرجى تقديم المزيد من التفاصيل
es: Advertencia: Por favor proporciona más detalles
hi: चेतावनी: कृपया अधिक विवरण प्रदान करें
te: హెచ్చరిక: దయచేసి మరిన్ని వివరాలను అందించండి
zh: 警告：请提供更多详情

# accessibility_error
source: Error: %@
ar: خطأ: %@
hi: त्रुटि: %@
te: లోపం: %@
zh: 错误：%@

# accessibility_recipe_details
source: View recipe details for %@
ar: عرض تفاصيل الوصفة %@
es: Ver detalles de la receta %@
hi: %@ की रेसिपी विवरण देखें
te: %@ వంటక వివరాలను చూడండి
zh: 查看%@的食谱详情

# accessibility_recipe_details_hint
source: Navigate to detailed recipe view
ar: انتقل إلى عرض تفاصيل الوصفة
es: Navegar a vista detallada de la receta
hi: विस्तृत रेसिपी दृश्य पर नेविगेट करें
te: వివరణాత్మక వంటక దృశ్యానికి నావిగేట్ చేయండి
zh: 导航到详细食谱视图

# accessibility_start_cooking
source: Start cooking %@
ar: بدء طهي %@
es: Comenzar a cocinar %@
hi: %@ खाना बनाना शुरू करें
te: %@ వంటకాన్ని ప్రారంభించండి
zh: 开始烹饪%@

# accessibility_start_cooking_hint
source: View detailed cooking instructions for this recipe
ar: عرض تعليمات طهي مفصلة لهذه الوصفة
es: Ver instrucciones detalladas de cocción para esta receta
hi: इस रेसिपी के लिए विस्तृत खाना बनाने के निर्देश देखें
te: ఈ వంటకానికి వివరణాత్మక వంటక సూచనలను చూడండి
zh: 查看此食谱的详细烹饪说明

# accessibility_remove_favorite
source: Remove %@ from favorites
ar: إزالة %@ من المفضلة
es: Quitar %@ de favoritos
hi: %@ को पसंदीदा से हटाएं
te: %@ ని ఇష్టమైనవాటి నుండి తీసివేయండి
zh: 从收藏中移除%@

# accessibility_remove_favorite_hint
source: Delete this recipe from your favorites list
ar: احذف هذه الوصفة من قائمة المفضلة
es: Eliminar esta receta de tu lista de favoritos
hi: अपनी पसंदीदा सूची से इस रेसिपी को हटाएं
te: మీ ఇష్టమైనవాటి జాబితా నుండి ఈ వంటకాన్ని తొలగించండి
zh: 从您的收藏列表中删除此食谱

# accessibility_no_favorites
source: No favorites yet. Your favorite recipes will appear here.
ar: لا توجد مفضلات بعد. ستظهر وصفاتك المفضلة هنا.
es: Aún no hay favoritos. Tus recetas favoritas aparecerán aquí.
hi: अभी तक कोई पसंदीदा नहीं। आपकी पसंदीदा रेसिपी यहाँ दिखाई देंगी।
te: ఇంకా ఇష్టమైనవి లేవు. మీ ఇష్టమైన వంటకాలు ఇక్కడ కనిపిస్తాయి.
zh: 暂无收藏。您收藏的食谱将显示在这里。

# accessibility_no_search_results
source: No search results found. Try adjusting your search terms.
ar: لم يتم العثور على نتائج بحث. حاول تعديل مصطلحات البحث.
es: No se encontraron resultados de búsqueda. Intenta ajustar tus términos de búsqueda.
hi: कोई खोज परिणाम नहीं मिला। कृपया अपने खोज शब्दों को समायोजित करने का प्रयास करें।
te: శోధన ఫలితాలు కనుగొనబడలేదు. మీ శోధన పదాలను సర్దుబాటు చేయడానికి ప్రయత్నించండి.
zh: 未找到搜索结果。请尝试调整搜索词。
