Repository: datagandra/Cheffy
Catalog: Cheffy/Resources/*.lproj/Localizable.strings
Languages: ar, es, hi, te, zh

# accessibility_cooking_progress
source: Cooking progress: %@, %d%% complete
ar: تقدم الطهي: %@، %d%% مكتمل
es: Progreso de cocción: %@, %d%% completo
hi: खाना बनाने की प्रगति: %@, %d%% पूर्ण
te: వంటక పురోగతి: %@, %d%% పూర్తయింది
zh: 烹饪进度：%@，%d%%完成

# accessibility_recipe_info
source: %@, %@ cuisine, %@ difficulty
ar: %@، مطبخ %@، صعوبة %@
es: %@, cocina %@, dificultad %@
hi: %@, %@ खाना, %@ कठिनाई
te: %@, %@ వంటక శైలి, %@ కష్టత
zh: %@，%@菜系，%@难度

# accessibility_close_cooking_guide
source: Close cooking guide
ar: إغلاق دليل الطهي
es: Cerrar guía de cocción
hi: खाना बनाने की गाइड बंद करें
te: వంటక గైడ్‌ని మూసివేయండి
zh: 关闭烹饪指南

# accessibility_repeat_step
source: Repeat current step
ar: تكرار الخطوة الحالية
es: Repetir paso actual
hi: वर्तमान चरण दोहराएं
te: ప్రస్తుత దశను పునరావృతం చేయండి
zh: 重复当前步骤

# accessibility_recipe_name_input
source: Recipe name input field
ar: حقل إدخال اسم الوصفة
es: Campo de entrada del nombre de la receta
hi: रेसिपी नाम इनपुट फ़ील्ड
te: వంటక పేరు ఇన్‌పుట్ ఫీల్డ్
zh: 食谱名称输入字段

# accessibility_recipe_name_hint
source: Enter your recipe name or description, or leave empty for popular recipes
ar: أدخل اسم أو وصف وصفتك، أو اتركه فارغاً للوصفات الشائعة
es: Ingresa el nombre o descripción de tu receta, o deja vacío para recetas populares
hi: अपनी रेसिपी का नाम या विवरण दर्ज करें, या लोकप्रिय रेसिपी के लिए खाली छोड़ें
te: మీ వంటక పేరు లేదా వివరణను నమోదు చేయండి, లేదా జనప్రియ వంటకాల కోసం ఖాళీగా వదిలివేయండి
zh: 输入您的食谱名称或描述，或留空生成热门食谱

# accessibility_cuisine_dropdown
source: Cuisine selection dropdown
ar: قائمة منسدلة لاختيار المطبخ
es: Menú desplegable de selección de cocina
hi: खाना चयन ड्रॉपडाउन
te: వంటక శైలి ఎంపిక డ్రాప్‌డౌన్
zh: 菜系选择下拉菜单

# accessibility_cuisine_hint
source: Tap to select cuisine type
ar: انقر لاختيار نوع المطبخ
es: Toca para seleccionar tipo de cocina
hi: खाने का प्रकार चुनने के लिए टैप करें
te: వంటక శైలిని ఎంచుకోవడానికి నొక్కండి
zh: 点击选择菜系类型

# accessibility_dietary_restriction
source: %@ dietary restriction
ar: قيود غذائية %@
es: Restricción dietética %@
hi: %@ आहार प्रतिबंध
te: %@ ఆహార పరిమితి
zh: %@饮食限制

# accessibility_generate_button_hint
source: Double tap to generate recipe
ar: انقر مرتين لإنشاء وصفة
es: Doble toque para generar receta
hi: रेसिपी जनरेट करने के लिए दो बार टैप करें
te: వంటకాన్ని జనరేట్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击生成食谱

# accessibility_cuisine_option
source: %@ cuisine
ar: مطبخ %@
es: Cocina %@
hi: %@ खाना
te: %@ వంటక శైలి
zh: %@菜系

# accessibility_difficulty_option
source: %@ difficulty
ar: صعوبة %@
es: Dificultad %@
hi: %@ कठिनाई
te: %@ కష్టత
zh: %@难度

# accessibility_dietary_option
source: %@ dietary restriction
ar: قيود غذائية %@
es: Restricción dietética %@
hi: %@ आहार प्रतिबंध
te: %@ ఆహార పరిమితి
zh: %@饮食限制

# accessibility_error_message
source: Error: %@
ar: خطأ: %@
hi: त्रुटि: %@
te: లోపం: %@
zh: 错误：%@

# accessibility_api_key
source: Gemini API Key
ar: مفتاح API من Gemini
es: Clave API de Gemini
hi: Gemini API की
te: Gemini API కీ
zh: Gemini API密钥

# accessibility_api_key_hint
source: Double tap to configure API key
ar: انقر مرتين لضبط مفتاح API
es: Doble toque para configurar clave API
hi: API की कॉन्फ़िगर करने के लिए दो बार टैप करें
te: API కీని కాన్ఫిగర్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击配置API密钥

# accessibility_subscription
source: Subscription
ar: الاشتراك
es: Suscripción
hi: सदस्यता
te: చందా
zh: 订阅

# accessibility_generations_used
source: Generations Used
ar: الإنشاءات المستخدمة
es: Generaciones Usadas
hi: उपयोग किए गए जनरेशन
te: ఉపయోగించిన జనరేషన్లు
zh: 已使用生成次数

# accessibility_reset_generations
source: Double tap to reset generation count
ar: انقر مرتين لإعادة تعيين عدد الإنشاءات
es: Doble toque para reiniciar conteo de generaciones
hi: जनरेशन काउंटर रीसेट करने के लिए दो बार टैप करें
te: జనరేషన్ కౌంటర్ రీసెట్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击重置生成计数

# accessibility_upgrade_pro
source: Double tap to upgrade to PRO subscription
ar: انقر مرتين للترقية إلى اشتراك PRO
es: Doble toque para actualizar a suscripción PRO
hi: प्रो सदस्यता में अपग्रेड करने के लिए दो बार टैप करें
te: ప్రొ చందాకు అప్‌గ్రేడ్ చేయడానికి రెండుసార్లు నొక్కండి
zh: 双击升级到专业版订阅

# accessibility_app_version
source: App Version
ar: إصدار التطبيق
es: Versión de la App
hi: ऐप संस्करण
te: యాప్ వెర్షన్
zh: 应用版本

# accessibility_manage_cache
source: Double tap to manage cached recipes
ar: انقر مرتين لإدارة الوصفات المخزنة مؤقتاً
es: Doble toque para administrar recetas en caché
hi: कैश की गई रेसिपी प्रबंधित करने के लिए दो बार टैप करें
te: కాష్ చేయబడిన వంటకాలను నిర్వహించడానికి రెండుసార్లు నొక్కండి
zh: 双击管理缓存的食谱

# subscription_pro
source: PRO
hi: प्रो
te: ప్రొ
zh: 专业版
