{
  "cuisines": {
    "Mexican": [
      {
        "title": "Authentic Tacos al Pastor",
        "cuisine": "Mexican",
        "ingredients": ["2 lbs pork shoulder, thinly sliced", "1/2 cup achiote paste", "1/4 cup white vinegar", "1/4 cup orange juice", "1/4 cup pineapple juice", "3 cloves garlic, minced", "1 tsp oregano", "1 tsp cumin", "1/2 tsp black pepper", "1/2 tsp salt", "Corn tortillas", "1 pineapple, sliced", "1 onion, diced", "1/2 cup cilantro", "1 lime, cut into wedges", "Salsa verde for serving"],
        "instructions": "Mix achiote paste, white vinegar, orange juice, pineapple juice, minced garlic, oregano, cumin, black pepper, and salt to make marinade. Coat thinly sliced pork shoulder with marinade and refrigerate for 4 hours. Thread marinated pork onto skewers with pineapple slices. Grill over medium-high heat for 8-10 minutes, turning occasionally, until pork is cooked through and slightly charred. Warm corn tortillas on the grill. Remove pork and pineapple from skewers and chop finely. Serve pork and pineapple on warm tortillas with diced onion, cilantro, lime wedges, and salsa verde.",
        "proteins": ["pork shoulder"],
        "dietary_restrictions": ["gluten_free"],
        "cooking_time": 60,
        "difficulty": "medium"
      },
      {
        "title": "Mole Poblano",
        "cuisine": "Mexican",
        "ingredients": ["3 lbs chicken pieces", "6 dried ancho chiles", "4 dried pasilla chiles", "2 tbsp sesame seeds", "1/4 cup almonds", "1/4 cup peanuts", "2 tbsp pumpkin seeds", "1/4 cup raisins", "2 tbsp Mexican chocolate", "1/2 onion, roasted", "2 cloves garlic, roasted", "1 tsp cinnamon", "1/2 tsp cumin", "1/4 tsp cloves", "2 cups chicken broth", "2 tbsp vegetable oil", "1/4 cup fresh cilantro"],
        "instructions": "Toast sesame seeds, almonds, peanuts, and pumpkin seeds in a dry pan until golden. Remove and set aside. Stem and seed the dried chiles, then toast them briefly. Soak chiles in hot water for 20 minutes. In a blender, combine soaked chiles, toasted nuts and seeds, raisins, Mexican chocolate, roasted onion, garlic, cinnamon, cumin, and cloves. Blend until smooth, adding chicken broth as needed. Heat oil in a large pot and fry the mole paste for 5 minutes. Add remaining broth and simmer for 30 minutes until thickened. Add chicken pieces and simmer for 20 minutes until chicken is cooked through. Garnish with fresh cilantro and serve with rice and warm tortillas.",
        "proteins": ["chicken"],
        "dietary_restrictions": ["contains_nuts"],
        "cooking_time": 90,
        "difficulty": "hard"
      },
      {
        "title": "Enchiladas Verdes",
        "cuisine": "Mexican",
        "ingredients": ["12 corn tortillas", "2 lbs chicken breast, cooked and shredded", "1 lb tomatillos, husked", "2 jalapeños", "1 onion, diced", "3 cloves garlic", "1/4 cup cilantro", "1 cup sour cream", "1 cup Monterey Jack cheese, shredded", "1/4 cup vegetable oil", "1 lime, juiced", "Salt to taste"],
        "instructions": "Boil tomatillos and jalapeños in water for 10 minutes until soft. Drain and blend with diced onion, garlic, cilantro, lime juice, and salt to make salsa verde. Heat vegetable oil in a pan and lightly fry corn tortillas for 30 seconds each. Dip each tortilla in salsa verde and fill with shredded chicken breast. Roll up and place seam-side down in a baking dish. Pour remaining salsa verde over enchiladas. Top with sour cream and shredded Monterey Jack cheese. Bake at 350°F for 20 minutes until cheese is melted and bubbly. Serve hot with rice and beans.",
        "proteins": ["chicken breast"],
        "dietary_restrictions": ["contains_dairy", "gluten_free"],
        "cooking_time": 60,
        "difficulty": "medium"
      },
      {
        "title": "Pozole",
        "cuisine": "Mexican",
        "ingredients": ["2 lbs pork shoulder, cubed", "1 lb hominy", "6 dried guajillo chiles", "4 dried ancho chiles", "1 onion, diced", "4 cloves garlic, minced", "1 tsp oregano", "1 tsp cumin", "1 bay leaf", "2 cups chicken stock", "1/2 cup radishes, sliced", "1/2 cup cabbage, shredded", "1/2 cup cilantro", "1 lime, cut into wedges", "1 avocado, sliced"],
        "instructions": "Soak hominy overnight. Cook pork shoulder cubes in a large pot with chicken stock, diced onion, minced garlic, oregano, cumin, and bay leaf for 1.5 hours until tender. Add soaked hominy and cook for an additional 30 minutes. Stem and seed dried chiles, then toast briefly. Soak chiles in hot water for 20 minutes. Blend chiles with some cooking liquid until smooth. Add chile puree to pozole and simmer for 15 minutes. Season with salt. Serve hot with radishes, shredded cabbage, cilantro, lime wedges, and avocado slices.",
        "proteins": ["pork shoulder"],
        "dietary_restrictions": ["gluten_free"],
        "cooking_time": 150,
        "difficulty": "medium"
      },
      {
        "title": "Chiles Rellenos",
        "cuisine": "Mexican",
        "ingredients": ["6 poblano peppers", "1 lb Monterey Jack cheese, cut into strips", "4 eggs, separated", "1/2 cup all-purpose flour", "1/4 cup vegetable oil", "1 onion, diced", "3 cloves garlic, minced", "2 tomatoes, diced", "1 tsp oregano", "1/2 cup chicken stock", "1/4 cup fresh cilantro", "Salt to taste"],
        "instructions": "Roast poblano peppers over an open flame until charred. Place in a paper bag to steam for 10 minutes. Peel off charred skin and make a small slit to remove seeds. Stuff peppers with Monterey Jack cheese strips. Beat egg whites until stiff peaks form. Beat egg yolks and fold into whites. Coat stuffed peppers with flour, then dip in egg mixture. Heat vegetable oil and fry peppers until golden brown. For sauce, sauté diced onion and minced garlic. Add diced tomatoes, oregano, and chicken stock. Simmer for 10 minutes. Pour sauce over fried peppers and garnish with fresh cilantro.",
        "proteins": ["monterey jack cheese", "eggs"],
        "dietary_restrictions": ["vegetarian", "contains_dairy", "contains_gluten"],
        "cooking_time": 60,
        "difficulty": "hard"
      },
      {
        "title": "Tamales",
        "cuisine": "Mexican",
        "ingredients": ["2 cups masa harina", "1 cup lard", "1 cup chicken stock", "1 tsp baking powder", "1 tsp salt", "1 lb pork shoulder, cooked and shredded", "1/2 cup red chile sauce", "1 package corn husks", "1/2 cup Monterey Jack cheese", "1/4 cup fresh cilantro"],
        "instructions": "Soak corn husks in warm water for 30 minutes. Mix masa harina with lard, chicken stock, baking powder, and salt to form a smooth dough. Spread masa dough on corn husks. Fill with shredded pork shoulder, red chile sauce, and Monterey Jack cheese. Fold husks to enclose filling and tie with strips of husk. Steam tamales for 1 hour until masa is firm. Serve hot with salsa and fresh cilantro.",
        "proteins": ["pork shoulder", "monterey jack cheese"],
        "dietary_restrictions": ["contains_dairy", "gluten_free"],
        "cooking_time": 120,
        "difficulty": "hard"
      },
      {
        "title": "Guacamole",
        "cuisine": "Mexican",
        "ingredients": ["4 ripe avocados", "1 lime, juiced", "1/2 onion, diced", "2 tomatoes, diced", "1 jalapeño, minced", "1/4 cup fresh cilantro", "1 clove garlic, minced", "1/2 tsp salt", "1/4 tsp black pepper", "Tortilla chips for serving"],
        "instructions": "Cut avocados in half and remove pits. Scoop out flesh into a bowl. Mash avocados with a fork until smooth but still chunky. Add lime juice, diced onion, diced tomatoes, minced jalapeño, fresh cilantro, minced garlic, salt, and black pepper. Mix gently to combine. Taste and adjust seasoning. Serve immediately with tortilla chips to prevent browning.",
        "proteins": ["avocados"],
        "dietary_restrictions": ["vegetarian", "vegan", "gluten_free"],
        "cooking_time": 15,
        "difficulty": "easy"
      },
      {
        "title": "Churros",
        "cuisine": "Mexican",
        "ingredients": ["1 cup water", "1/2 cup butter", "1/4 tsp salt", "1 cup all-purpose flour", "3 eggs", "1/2 cup sugar", "1 tsp cinnamon", "Vegetable oil for frying", "1/4 cup chocolate sauce"],
        "instructions": "Bring water, butter, and salt to a boil in a saucepan. Remove from heat and stir in all-purpose flour until mixture forms a ball. Beat in eggs one at a time until smooth. Transfer dough to a piping bag fitted with a star tip. Heat vegetable oil to 375°F. Pipe 4-inch strips of dough into hot oil. Fry for 2-3 minutes until golden brown. Drain on paper towels. Mix sugar and cinnamon. Roll hot churros in cinnamon sugar. Serve warm with chocolate sauce for dipping.",
        "proteins": ["eggs"],
        "dietary_restrictions": ["vegetarian", "contains_dairy", "contains_gluten"],
        "cooking_time": 30,
        "difficulty": "medium"
      },
      {
        "title": "Ceviche",
        "cuisine": "Mexican",
        "ingredients": ["1 lb fresh white fish, cubed", "1/2 cup lime juice", "1/2 cup lemon juice", "1 red onion, diced", "2 tomatoes, diced", "1 jalapeño, minced", "1/4 cup fresh cilantro", "1 avocado, diced", "1 cucumber, diced", "1/2 cup orange juice", "1 tsp salt", "1/4 tsp black pepper", "Tortilla chips for serving"],
        "instructions": "Cut fresh white fish into small cubes. Combine lime juice and lemon juice in a bowl. Add fish cubes and marinate in citrus juices for 30 minutes, stirring occasionally. The acid will 'cook' the fish. Drain excess juice and add diced red onion, diced tomatoes, minced jalapeño, fresh cilantro, diced avocado, and diced cucumber. Add orange juice, salt, and black pepper. Mix gently to combine. Refrigerate for 15 minutes to allow flavors to meld. Serve cold with tortilla chips.",
        "proteins": ["white fish"],
        "dietary_restrictions": ["gluten_free"],
        "cooking_time": 45,
        "difficulty": "easy"
      },
      {
        "title": "Flan",
        "cuisine": "Mexican",
        "ingredients": ["1 cup sugar", "1/4 cup water", "4 eggs", "1 can sweetened condensed milk", "1 can evaporated milk", "1 tsp vanilla extract", "1/4 tsp salt", "1/4 cup caramel sauce"],
        "instructions": "Preheat oven to 350°F. Heat sugar and water in a saucepan over medium heat until sugar dissolves and turns amber. Pour caramel into 6 ramekins, swirling to coat bottoms. Beat eggs in a bowl. Add sweetened condensed milk, evaporated milk, vanilla extract, and salt. Mix until smooth. Pour custard mixture over caramel in ramekins. Place ramekins in a baking dish and add hot water to come halfway up sides. Bake for 45 minutes until set. Let cool completely. Run a knife around edges and invert onto plates. Drizzle with caramel sauce and serve chilled.",
        "proteins": ["eggs"],
        "dietary_restrictions": ["vegetarian", "contains_dairy", "gluten_free"],
        "cooking_time": 60,
        "difficulty": "medium"
      }
    ]
  }
} 